run/boxSimulation_3d/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 5 0)
    (0 5 0)
    (0 0 1)
    (1 0 1)
    (1 5 1)
    (0 5 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 50 20) simpleGrading 
    (
    (
        (0.2 0.3 5)    // 20% y-dir, 30% cells, expansion = 4
        (0.6 0.4 1)    // 60% y-dir, 40% cells, expansion = 1
        (0.2 0.3 0.2) // 20% y-dir, 30% cells, expansion = 0.25 (1/4)
    )
    1 
    (
        (0.2 0.3 5)    // 20% y-dir, 30% cells, expansion = 4
        (0.6 0.4 1)    // 60% y-dir, 40% cells, expansion = 1
        (0.2 0.3 0.2) // 20% y-dir, 30% cells, expansion = 0.25 (1/4)
    )
    )
);

edges
(
);

boundary
(
    bottom
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }
    top
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
